In [39]:

"""
Title - Write a Python program to append a new row 'k' to data frame with given values for
        each column. Now delete the new row and return the original DataFrame.
        exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew',
        'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
        labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
        Values for each column will be:
        name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"

Author name - Aditya Kumar
Ceation time - ‎‎11 ‎March ‎2021 ‏‎
Modified time - ‎‎‎11 ‎March ‎2021‎

"""

import pandas as pd
import numpy as np


data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew',
        'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
        
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

frame = {'name' : "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': "yes", 'label': "k"}

dataFrame = pd.DataFrame(data , index = labels)
dataFrame

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [40]:
# solution with append
dataFrame2 = pd.DataFrame(data , index = labels)
new_student = pd.Series({'name' : "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': "yes"} , name = 'k')
dataFrame2 = dataFrame.append(new_student)
dataFrame2

        name  score  attempts qualify label
a  Anastasia   12.5         1     yes   NaN
b       Dima    9.0         3      no   NaN
c  Katherine   16.5         2     yes   NaN
d      James    NaN         3      no   NaN
e      Emily    9.0         2      no   NaN
f    Michael   20.0         3     yes   NaN
g    Matthew   14.5         1     yes   NaN
h      Laura    NaN         1      no   NaN
i      Kevin    8.0         2      no   NaN
j      Jonas   19.0         1     yes   NaN
k     Suresh   15.5         1     yes     k

In [41]:
print("original dataframe is unchanged:")
dataFrame

original dataframe is unchanged:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [42]:
# alternative solution:
dataFrame.loc['k'] = {'name' : "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': "yes"}
dataFrame

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [43]:
print("original is:")
dataFrame.drop('k', inplace=True)
dataFrame

original is:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes